<a href="https://colab.research.google.com/github/je-mappelle-deepthi/house_price_prediction/blob/main/DEEPTHI_HOUSE_PRICE_PREDICTION.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import sklearn

In [ ]:
from sklearn import linear_model

In [ ]:
dataset = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/house_price_prediction/training-set-house_price_prediction.csv")
dataset

    AREA  NUMBER_OF_BEDROOMS  NUMBER_OF_BATHROOMS    PRICE
0   1000                   2                    2  3500000
1   1000                   3                    2  3600000
2   1200                   3                    3  3800000
3   1200                   2                    2  3700000
4    750                   2                    1  3000000
5    750                   1                    1  2800000
6    750                   2                    2  2900000
7    500                   1                    1  2500000
8    625                   1                    1  2700000
9    500                   1                    1  2400000
10   450                   0                    1  1800000
11   450                   0                    1  2000000
12  1000                   3                    2  4000000
13  1250                   3                    3  4200000
14  1250                   3                    2  4100000
15  1250                   3                    3  4400000
16  1500                   3                    2  4900000
17  1500                   3                    2  5250000
18  1500                   4                    3  5500000
19  1500                   2                    2  5050000
20  1500                   2                    2  4700000
21  1650                   5                    5  5565000
22  1650                   4                    5  5340000
23  1700                   3                    3  6590000
24  2400                   6                    6  9999999
25  2400                   5                    6  9500000
26  2000                   4                    5  8000000
27  1900                   3                    3  7500000
28  1850                   3                    4  7500000
29  2400                   6                    6  9899999

In [ ]:
reg = linear_model.LinearRegression()
reg.fit(dataset[['AREA','NUMBER_OF_BEDROOMS','NUMBER_OF_BATHROOMS']],dataset.PRICE)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
test= pd.read_csv("/content/drive/MyDrive/Colab Notebooks/house_price_prediction/test-set-house_price_prediction.csv")
test

   AREA  NUMBER_OF_BEDROOMS  NUMBER_OF_BATHROOMS
0  5000                  12                   13
1  1500                   4                    5
2  1820                   5                    5
3   300                   0                    1
4   480                   1                    1
5   460                   1                    1
6  3000                   6                    6

In [ ]:
reg.predict(test)

array([19327266.12823422,  5939169.78321295,  6950091.4164928 ,
        1219009.96286981,  1727487.28832521,  1655709.53006457,
       11288352.73504658])